[Killed] BlockStatement
src/main/pages/AdminJobsPage.jsx:135:57
 
   // *** RecordCommonStats job ***
 
-  const objectToAxiosParamsRecordCommonStatsJob = () => {
-    return {
-      url: `/api/jobs/launch/recordcommonstats`,
-      method: "POST",
-    };
-  };
+  const objectToAxiosParamsRecordCommonStatsJob = () => {};
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit record common stats job
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
src/main/pages/AdminJobsPage.jsx:136:12
   // *** RecordCommonStats job ***
 
   const objectToAxiosParamsRecordCommonStatsJob = () => {
-    return {
-      url: `/api/jobs/launch/recordcommonstats`,
-      method: "POST",
-    };
+    return {};
   };
 
killedBy: AdminJobsPage tests user can submit record common stats job
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/pages/AdminJobsPage.jsx:150:50
   );
 
   // Stryker restore all
-  const submitRecordCommonStatsJob = async () => {
-    toast("Submitted Job: Record Common Stats");
-    RecordCommonStatsMutation.mutate();
-  };
+  const submitRecordCommonStatsJob = async () => {};
 
   // *** Instructor Report job ***
killedBy: AdminJobsPage tests user can submit record common stats job
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:159:13
 
   const objectToAxiosParamsInstructorReportJob = () => ({
     url: `/api/jobs/launch/instructorreport`,
-    method: "POST",
+    method: "",
   });
 
killedBy: AdminJobsPage tests user can submit instructor report job
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
