[Killed] BlockStatement
main/components/Jobs/RecordCommonStatsForm.jsx:4:50
 import { Button, Form } from "react-bootstrap";
 import { useForm } from "react-hook-form";
 
-function RecordCommonStatsForm({ submitAction }) {
-  const { handleSubmit } = useForm();
-
-  return (
-    <Form onSubmit={handleSubmit(submitAction)}>
-      <p>Click this button to record all common stats!</p>
-      <Button type="submit" data-testid="RecordCommonStats-Submit-Button">
-        Generate
-      </Button>
-    </Form>
-  );
-}
+function RecordCommonStatsForm({ submitAction }) {}
 export default RecordCommonStatsForm;
 
killedBy: AdminJobsPage tests user can submit record common stats job
statusReason: Unable to find an element by: [data-testid="RecordCommonStats-Submit-Button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
