[Survived] BooleanLiteral
main/components/Chat/ChatDisplay.jsx:14:42
 
   const [page, setPage] = useState(0);
   const [allMessages, setAllMessages] = useState([]);
-  const [hasMore, setHasMore] = useState(true);
+  const [hasMore, setHasMore] = useState(false);
 
   const { data: messagesPage } = useBackend(

[Killed] ObjectLiteral
main/components/Chat/ChatDisplay.jsx:20:5
     [
       `/api/chat/get?page=${page}&size=${initialMessagePageSize}&commonsId=${commonsId}`,
     ],
-    {
-      method: "GET",
-      url: `/api/chat/get`,
-      params: {
-        commonsId: commonsId,
-        page: page,
-        size: initialMessagePageSize,
-      },
-    },
+    {},
     { content: [], last: true },
     { refetchInterval: refreshRate },
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: Unable to find an element by: [data-testid="/^ChatMessageDisplay-\d+$/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ChatDisplay"
      style="display: flex; flex-direction: column-reverse; overflow-y: scroll; max-height: 300px;"

[Killed] StringLiteral
main/components/Chat/ChatDisplay.jsx:22:12
     ],
     {
       method: "GET",
-      url: `/api/chat/get`,
+      url: ``,
       params: {
         commonsId: commonsId,
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: Unable to find an element by: [data-testid="/^ChatMessageDisplay-\d+$/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ChatDisplay"
      style="display: flex; flex-direction: column-reverse; overflow-y: scroll; max-height: 300px;"

[Survived] BooleanLiteral
main/components/Chat/ChatDisplay.jsx:29:26
         size: initialMessagePageSize,
       },
     },
-    { content: [], last: true },
+    { content: [], last: false },
     { refetchInterval: refreshRate },
   );

[Survived] ObjectLiteral
main/components/Chat/ChatDisplay.jsx:29:5
         size: initialMessagePageSize,
       },
     },
-    { content: [], last: true },
+    {},
     { refetchInterval: refreshRate },
   );

[Survived] StringLiteral
main/components/Chat/ChatDisplay.jsx:34:6
   );
 
   const { data: userCommonsList } = useBackend(
-    [`/api/usercommons/commons/all`],
+    [``],
     {
       method: "GET",

[Killed] BlockStatement
main/components/Chat/ChatDisplay.jsx:49:19
   // Stryker restore all
 
   // when messagesPage updates, merge into allMessages
-  useEffect(() => {
-    if (messagesPage && Array.isArray(messagesPage.content)) {
-      if (page === 0) {
-        setAllMessages(messagesPage.content);
-      } else {
-        setAllMessages((prev) => [...prev, ...messagesPage.content]);
-      }
-      setHasMore(!messagesPage.last);
-    }
-  }, [messagesPage, page]);
+  useEffect(() => {}, [messagesPage, page]);
 
   // const sortedMessages = allMessages.sort((a, b) => b.id - a.id);
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: Unable to find an element by: [data-testid="/^ChatMessageDisplay-\d+$/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ChatDisplay"
      style="display: flex; flex-direction: column-reverse; overflow-y: scroll; max-height: 300px;"

[Killed] BlockStatement
main/components/Chat/ChatDisplay.jsx:50:62
 
   // when messagesPage updates, merge into allMessages
   useEffect(() => {
-    if (messagesPage && Array.isArray(messagesPage.content)) {
-      if (page === 0) {
-        setAllMessages(messagesPage.content);
-      } else {
-        setAllMessages((prev) => [...prev, ...messagesPage.content]);
-      }
-      setHasMore(!messagesPage.last);
-    }
+    if (messagesPage && Array.isArray(messagesPage.content)) {}
   }, [messagesPage, page]);
 
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: Unable to find an element by: [data-testid="/^ChatMessageDisplay-\d+$/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ChatDisplay"
      style="display: flex; flex-direction: column-reverse; overflow-y: scroll; max-height: 300px;"

[Killed] ConditionalExpression
main/components/Chat/ChatDisplay.jsx:50:9
 
   // when messagesPage updates, merge into allMessages
   useEffect(() => {
-    if (messagesPage && Array.isArray(messagesPage.content)) {
+    if (false) {
       if (page === 0) {
         setAllMessages(messagesPage.content);
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: Unable to find an element by: [data-testid="/^ChatMessageDisplay-\d+$/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ChatDisplay"
      style="display: flex; flex-direction: column-reverse; overflow-y: scroll; max-height: 300px;"

[Killed] BlockStatement
main/components/Chat/ChatDisplay.jsx:51:23
   // when messagesPage updates, merge into allMessages
   useEffect(() => {
     if (messagesPage && Array.isArray(messagesPage.content)) {
-      if (page === 0) {
-        setAllMessages(messagesPage.content);
-      } else {
+      if (page === 0) {} else {
         setAllMessages((prev) => [...prev, ...messagesPage.content]);
       }
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: Unable to find an element by: [data-testid="/^ChatMessageDisplay-\d+$/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ChatDisplay"
      style="display: flex; flex-direction: column-reverse; overflow-y: scroll; max-height: 300px;"

[Killed] EqualityOperator
main/components/Chat/ChatDisplay.jsx:51:11
   // when messagesPage updates, merge into allMessages
   useEffect(() => {
     if (messagesPage && Array.isArray(messagesPage.content)) {
-      if (page === 0) {
+      if (page !== 0) {
         setAllMessages(messagesPage.content);
       } else {
killedBy: ChatDisplay tests loads 10 messages first, then loads 2 older messages after clicking More messages
statusReason: expected [ <div …(2)>…(1)</div>, …(1) ] to have a length of 12 but got 2

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/components/Chat/ChatDisplay.jsx:53:14
     if (messagesPage && Array.isArray(messagesPage.content)) {
       if (page === 0) {
         setAllMessages(messagesPage.content);
-      } else {
-        setAllMessages((prev) => [...prev, ...messagesPage.content]);
-      }
+      } else {}
       setHasMore(!messagesPage.last);
     }
killedBy: ChatDisplay tests loads 10 messages first, then loads 2 older messages after clicking More messages
statusReason: expected [ <div …(2)>…(1)</div>, …(9) ] to have a length of 12 but got 10

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrowFunction
main/components/Chat/ChatDisplay.jsx:54:24
       if (page === 0) {
         setAllMessages(messagesPage.content);
       } else {
-        setAllMessages((prev) => [...prev, ...messagesPage.content]);
+        setAllMessages(() => undefined);
       }
       setHasMore(!messagesPage.last);
killedBy: ChatDisplay tests loads 10 messages first, then loads 2 older messages after clicking More messages
statusReason: Unable to find an element by: [data-testid="/^ChatMessageDisplay-\d+$/"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BooleanLiteral
main/components/Chat/ChatDisplay.jsx:56:18
       } else {
         setAllMessages((prev) => [...prev, ...messagesPage.content]);
       }
-      setHasMore(!messagesPage.last);
+      setHasMore(messagesPage.last);
     }
   }, [messagesPage, page]);
killedBy: ChatDisplay tests loads 10 messages first, then loads 2 older messages after clicking More messages
statusReason: Unable to find an element by: [data-testid="ChatDisplay-More"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ChatDisplay"
      style="display: flex; flex-direction: column-reverse; overflow-y: scroll; max-height: 300px;"

[Survived] MethodExpression
main/components/Chat/ChatDisplay.jsx:61:26
   }, [messagesPage, page]);
 
   // const sortedMessages = allMessages.sort((a, b) => b.id - a.id);
-  const sortedMessages = [...allMessages].sort((a, b) => b.id - a.id);
+  const sortedMessages = [...allMessages];
 
   const userIdToUsername = userCommonsList.reduce((acc, user) => {

[Survived] ArrowFunction
main/components/Chat/ChatDisplay.jsx:61:48
   }, [messagesPage, page]);
 
   // const sortedMessages = allMessages.sort((a, b) => b.id - a.id);
-  const sortedMessages = [...allMessages].sort((a, b) => b.id - a.id);
+  const sortedMessages = [...allMessages].sort(() => undefined);
 
   const userIdToUsername = userCommonsList.reduce((acc, user) => {

[Killed] BlockStatement
main/components/Chat/ChatDisplay.jsx:63:66
   // const sortedMessages = allMessages.sort((a, b) => b.id - a.id);
   const sortedMessages = [...allMessages].sort((a, b) => b.id - a.id);
 
-  const userIdToUsername = userCommonsList.reduce((acc, user) => {
-    acc[user.userId] = user.username || "";
-    return acc;
-  }, {});
+  const userIdToUsername = userCommonsList.reduce((acc, user) => {}, {});
 
   return (
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: Unable to find an element by: [data-testid="/^ChatMessageDisplay-\d+$/"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] LogicalOperator
main/components/Chat/ChatDisplay.jsx:64:24
   const sortedMessages = [...allMessages].sort((a, b) => b.id - a.id);
 
   const userIdToUsername = userCommonsList.reduce((acc, user) => {
-    acc[user.userId] = user.username || "";
+    acc[user.userId] = user.username && "";
     return acc;
   }, {});
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  George Washington
Received:
  Anonymous

[Killed] ConditionalExpression
main/components/Chat/ChatDisplay.jsx:64:24
   const sortedMessages = [...allMessages].sort((a, b) => b.id - a.id);
 
   const userIdToUsername = userCommonsList.reduce((acc, user) => {
-    acc[user.userId] = user.username || "";
+    acc[user.userId] = false;
     return acc;
   }, {});
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  George Washington
Received:
  Anonymous

[Killed] StringLiteral
main/components/Chat/ChatDisplay.jsx:71:18
   return (
     <div
       style={{
-        display: "flex",
+        display: "",
         flexDirection: "column-reverse",
         overflowY: "scroll",
killedBy: ChatDisplay tests renders without crashing
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- display: flex;
+ display: block;

[Killed] StringLiteral
main/components/Chat/ChatDisplay.jsx:73:20
       style={{
         display: "flex",
         flexDirection: "column-reverse",
-        overflowY: "scroll",
+        overflowY: "",
         maxHeight: "300px",
       }}
killedBy: ChatDisplay tests renders without crashing
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- overflowY: scroll;

[Killed] StringLiteral
main/components/Chat/ChatDisplay.jsx:74:20
         display: "flex",
         flexDirection: "column-reverse",
         overflowY: "scroll",
-        maxHeight: "300px",
+        maxHeight: "",
       }}
       data-testid="ChatDisplay"
killedBy: ChatDisplay tests renders without crashing
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- maxHeight: 300px;

[Killed] ConditionalExpression
main/components/Chat/ChatDisplay.jsx:78:8
       }}
       data-testid="ChatDisplay"
     >
-      {Array.isArray(sortedMessages) &&
-        sortedMessages.map((message) => (
-          <ChatMessageDisplay
-            key={message.id}
-            message={{
-              ...message,
-              username: userIdToUsername[message.userId],
-            }}
-          />
-        ))}
+      {false}
 
       {hasMore && (
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: Unable to find an element by: [data-testid="/^ChatMessageDisplay-\d+$/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ChatDisplay"
      style="display: flex; flex-direction: column-reverse; overflow-y: scroll; max-height: 300px;"

[Killed] LogicalOperator
main/components/Chat/ChatDisplay.jsx:78:8
       }}
       data-testid="ChatDisplay"
     >
-      {Array.isArray(sortedMessages) &&
-        sortedMessages.map((message) => (
-          <ChatMessageDisplay
-            key={message.id}
-            message={{
-              ...message,
-              username: userIdToUsername[message.userId],
-            }}
-          />
-        ))}
+      {Array.isArray(sortedMessages) || sortedMessages.map(message => <ChatMessageDisplay key={message.id} message={{
+  ...message,
+  username: userIdToUsername[message.userId]
+}} />)}
 
       {hasMore && (
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: Unable to find an element by: [data-testid="/^ChatMessageDisplay-\d+$/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ChatDisplay"
      style="display: flex; flex-direction: column-reverse; overflow-y: scroll; max-height: 300px;"

[Killed] ArrowFunction
main/components/Chat/ChatDisplay.jsx:79:28
       data-testid="ChatDisplay"
     >
       {Array.isArray(sortedMessages) &&
-        sortedMessages.map((message) => (
-          <ChatMessageDisplay
-            key={message.id}
-            message={{
-              ...message,
-              username: userIdToUsername[message.userId],
-            }}
-          />
-        ))}
+        sortedMessages.map(() => undefined)}
 
       {hasMore && (
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: Unable to find an element by: [data-testid="/^ChatMessageDisplay-\d+$/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ChatDisplay"
      style="display: flex; flex-direction: column-reverse; overflow-y: scroll; max-height: 300px;"

[Killed] ConditionalExpression
main/components/Chat/ChatDisplay.jsx:89:8
           />
         ))}
 
-      {hasMore && (
-        <button
-          onClick={() => setPage((p) => p + 1)}
-          data-testid="ChatDisplay-More"
-          style={{ marginTop: "8px" }}
-        >
-          More messages
-        </button>
-      )}
+      {false}
       {!hasMore && (
         <div
killedBy: ChatDisplay tests loads 10 messages first, then loads 2 older messages after clicking More messages
statusReason: Unable to find an element by: [data-testid="ChatDisplay-More"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ChatDisplay"
      style="display: flex; flex-direction: column-reverse; overflow-y: scroll; max-height: 300px;"

[Killed] LogicalOperator
main/components/Chat/ChatDisplay.jsx:89:8
           />
         ))}
 
-      {hasMore && (
-        <button
-          onClick={() => setPage((p) => p + 1)}
-          data-testid="ChatDisplay-More"
-          style={{ marginTop: "8px" }}
-        >
-          More messages
-        </button>
-      )}
+      {hasMore || <button onClick={() => setPage(p => p + 1)} data-testid="ChatDisplay-More" style={{
+  marginTop: "8px"
+}}>
+          More messages
+        </button>}
       {!hasMore && (
         <div
killedBy: ChatDisplay tests loads 10 messages first, then loads 2 older messages after clicking More messages
statusReason: Unable to find an element by: [data-testid="ChatDisplay-More"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ChatDisplay"
      style="display: flex; flex-direction: column-reverse; overflow-y: scroll; max-height: 300px;"

[Killed] ArrowFunction
main/components/Chat/ChatDisplay.jsx:91:20
 
       {hasMore && (
         <button
-          onClick={() => setPage((p) => p + 1)}
+          onClick={() => undefined}
           data-testid="ChatDisplay-More"
           style={{ marginTop: "8px" }}
killedBy: ChatDisplay tests loads 10 messages first, then loads 2 older messages after clicking More messages
statusReason: expected [ <div …(2)>…(1)</div>, …(9) ] to have a length of 12 but got 10

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArithmeticOperator
main/components/Chat/ChatDisplay.jsx:91:41
 
       {hasMore && (
         <button
-          onClick={() => setPage((p) => p + 1)}
+          onClick={() => setPage((p) => p - 1)}
           data-testid="ChatDisplay-More"
           style={{ marginTop: "8px" }}
killedBy: ChatDisplay tests loads 10 messages first, then loads 2 older messages after clicking More messages
statusReason: expected [ <div …(2)>…(1)</div>, …(9) ] to have a length of 12 but got 10

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Survived] StringLiteral
main/components/Chat/ChatDisplay.jsx:93:31
         <button
           onClick={() => setPage((p) => p + 1)}
           data-testid="ChatDisplay-More"
-          style={{ marginTop: "8px" }}
+          style={{ marginTop: "" }}
         >
           More messages

[Killed] ConditionalExpression
main/components/Chat/ChatDisplay.jsx:98:8
           More messages
         </button>
       )}
-      {!hasMore && (
-        <div
-          data-testid="ChatDisplay-End"
-          style={{ textAlign: "center", opacity: 0.7, marginTop: "4px" }}
-        >
-          No more messages
-        </div>
-      )}
+      {true}
     </div>
   );
killedBy: ChatDisplay tests loads 10 messages first, then loads 2 older messages after clicking More messages
statusReason: Unable to find an element by: [data-testid="ChatDisplay-End"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ChatDisplay"
      style="display: flex; flex-direction: column-reverse; overflow-y: scroll; max-height: 300px;"

[Killed] LogicalOperator
main/components/Chat/ChatDisplay.jsx:98:8
           More messages
         </button>
       )}
-      {!hasMore && (
-        <div
-          data-testid="ChatDisplay-End"
-          style={{ textAlign: "center", opacity: 0.7, marginTop: "4px" }}
-        >
-          No more messages
-        </div>
-      )}
+      {!hasMore || <div data-testid="ChatDisplay-End" style={{
+  textAlign: "center",
+  opacity: 0.7,
+  marginTop: "4px"
+}}>
+          No more messages
+        </div>}
     </div>
   );
killedBy: ChatDisplay tests loads 10 messages first, then loads 2 older messages after clicking More messages
statusReason: Unable to find an element by: [data-testid="ChatDisplay-End"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ChatDisplay"
      style="display: flex; flex-direction: column-reverse; overflow-y: scroll; max-height: 300px;"

[Survived] StringLiteral
main/components/Chat/ChatDisplay.jsx:101:31
       {!hasMore && (
         <div
           data-testid="ChatDisplay-End"
-          style={{ textAlign: "center", opacity: 0.7, marginTop: "4px" }}
+          style={{ textAlign: "", opacity: 0.7, marginTop: "4px" }}
         >
           No more messages
