[Killed] ObjectLiteral
main/components/Courses/CourseForm.jsx:43:32
           id="code"
           type="text"
           isInvalid={Boolean(errors.code)}
-          {...register("code", {
-            required: "Code is required.",
-            maxLength: {
-              value: 30,
-              message: "Code max length 30 characters",
-            },
-          })}
+          {...register("code", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: CourseForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Code is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Courses/CourseForm.jsx:44:23
           type="text"
           isInvalid={Boolean(errors.code)}
           {...register("code", {
-            required: "Code is required.",
+            required: "",
             maxLength: {
               value: 30,
killedBy: CourseForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Code is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/Courses/CourseForm.jsx:52:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.code?.message}
+          {errors.code.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: CourseForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/Courses/CourseForm.jsx:69:24
             required: "Name is required.",
             maxLength: {
               value: 100,
-              message: "Name max length 100 characters",
+              message: "",
             },
           })}
killedBy: CourseForm tests shows max length validation error
statusReason: Unable to find an element with the text: /Name max length 100 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Courses/CourseForm.jsx:87:24
           isInvalid={Boolean(errors.term)}
           {...register("term", {
             required: "Term is required.",
-            maxLength: {
-              value: 10,
-              message: "Term max length 10 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: CourseForm tests shows max length validation error
statusReason: Unable to find an element with the text: /Term max length 10 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
