[Killed] ArrowFunction
main/components/Chat/ChatDisplay.jsx:72:27
         maxHeight: "300px",
       }}
     >
-      {sortedMessages.map((m) => (
-        <ChatMessageDisplay
-          key={m.id}
-          message={{
-            ...m,
-            username: userIdToUsername[m.userId],
-          }}
-        />
-      ))}
+      {sortedMessages.map(() => undefined)}
 
       {!isLastPage ? (
killedBy: ChatDisplay tests displays three messages with correct usernames and sorted newest to oldest
statusReason: Unable to find an element by: [data-testid="/^ChatMessageDisplay-\d+$/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ChatDisplay"
      style="display: flex; flex-direction: column-reverse; overflow-y: scroll; max-height: 300px;"

[Killed] ArithmeticOperator
main/components/Chat/ChatDisplay.jsx:85:41
       {!isLastPage ? (
         <button
           data-testid="MoreMessagesButton"
-          onClick={() => setPage((p) => p + 1)}
+          onClick={() => setPage((p) => p - 1)}
         >
           More messages
killedBy: ChatDisplay tests loads 10 messages first, then 2 older messages after clicking More messages
statusReason: expected [ <div …(2)>…(1)</div>, …(9) ] to have a length of 12 but got 10

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrowFunction
main/components/Chat/ChatDisplay.jsx:85:34
       {!isLastPage ? (
         <button
           data-testid="MoreMessagesButton"
-          onClick={() => setPage((p) => p + 1)}
+          onClick={() => setPage(() => undefined)}
         >
           More messages
killedBy: ChatDisplay tests loads 10 messages first, then 2 older messages after clicking More messages
statusReason: expected [ <div …(2)>…(1)</div>, …(9) ] to have a length of 12 but got 10

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
