[Killed] ArrayDeclaration
main/components/Chat/ChatDisplay.jsx:6:44
 import { useBackend } from "main/utils/useBackend";
 
 const ChatDisplay = ({ commonsId }) => {
-  const [messages, setMessages] = useState([]);
+  const [messages, setMessages] = useState(["Stryker was here"]);
 
   const [page, setPage] = useState(0);
killedBy: ChatDisplay tests displays no messages correctly
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="card-title h5"
  data-testid="ChatMessageDisplay-undefined-User"
  style="margin: 0px;"
>
  Anonymous

[Killed] BooleanLiteral
main/components/Chat/ChatDisplay.jsx:10:48
 
   const [page, setPage] = useState(0);
 
-  const [isLastPage, setIsLastPage] = useState(false);
+  const [isLastPage, setIsLastPage] = useState(true);
 
   const processedMessageIds = useRef(new Set());
killedBy: ChatDisplay tests initial MoreMessagesButton appears before backend data arrives
statusReason: Unable to find an element by: [data-testid="MoreMessagesButton"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ChatDisplay"
      style="display: flex; flex-direction: column-reverse; overflow-y: scroll; max-height: 300px;"

[Killed] BlockStatement
main/components/Chat/ChatDisplay.jsx:55:66
   }, [messagesPage]);
 
   // Stryker restore all
-  const userIdToUsername = userCommonsList.reduce((acc, user) => {
-    acc[user.userId] = user.username || "";
-    return acc;
-  }, {});
+  const userIdToUsername = userCommonsList.reduce((acc, user) => {}, {});
 
   const sortedMessages = [...messages].sort((a, b) => b.id - a.id);
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: Unable to find an element by: [data-testid="ChatDisplay"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArithmeticOperator
main/components/Chat/ChatDisplay.jsx:60:55
     return acc;
   }, {});
 
-  const sortedMessages = [...messages].sort((a, b) => b.id - a.id);
+  const sortedMessages = [...messages].sort((a, b) => b.id + a.id);
 
   return (
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: expected 'ChatMessageDisplay-2' to be 'ChatMessageDisplay-1' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrowFunction
main/components/Chat/ChatDisplay.jsx:60:45
     return acc;
   }, {});
 
-  const sortedMessages = [...messages].sort((a, b) => b.id - a.id);
+  const sortedMessages = [...messages].sort(() => undefined);
 
   return (
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: expected 'ChatMessageDisplay-2' to be 'ChatMessageDisplay-1' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/components/Chat/ChatDisplay.jsx:65:14
   return (
     <div
       data-testid="ChatDisplay"
-      style={{
-        display: "flex",
-        flexDirection: "column-reverse",
-        overflowY: "scroll",
-        maxHeight: "300px",
-      }}
+      style={{}}
     >
       {sortedMessages.map((message) => (
killedBy: ChatDisplay tests renders without crashing
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- overflowY: scroll;

[Killed] ArrowFunction
main/components/Chat/ChatDisplay.jsx:72:27
         maxHeight: "300px",
       }}
     >
-      {sortedMessages.map((message) => (
-        <ChatMessageDisplay
-          key={message.id}
-          message={{
-            ...message,
-            username: userIdToUsername[message.userId],
-          }}
-        />
-      ))}
+      {sortedMessages.map(() => undefined)}
 
       {!isLastPage ? (
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: Cannot read properties of undefined (reading 'getAttribute')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BooleanLiteral
main/components/Chat/ChatDisplay.jsx:82:8
         />
       ))}
 
-      {!isLastPage ? (
+      {isLastPage ? (
         <button
           data-testid="MoreMessagesButton"
killedBy: ChatDisplay tests loads 10 messages first, then 2 older messages after clicking More messages
statusReason: Unable to find an element by: [data-testid="MoreMessagesButton"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ChatDisplay"
      style="display: flex; flex-direction: column-reverse; overflow-y: scroll; max-height: 300px;"

[Killed] ArithmeticOperator
main/components/Chat/ChatDisplay.jsx:85:34
       {!isLastPage ? (
         <button
           data-testid="MoreMessagesButton"
-          onClick={() => setPage(page + 1)}
+          onClick={() => setPage(page - 1)}
         >
           More messages
killedBy: ChatDisplay tests loads 10 messages first, then 2 older messages after clicking More messages
statusReason: expected [ <div …(2)>…(1)</div>, …(9) ] to have a length of 12 but got 10

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrowFunction
main/components/Chat/ChatDisplay.jsx:85:20
       {!isLastPage ? (
         <button
           data-testid="MoreMessagesButton"
-          onClick={() => setPage(page + 1)}
+          onClick={() => undefined}
         >
           More messages
killedBy: ChatDisplay tests loads 10 messages first, then 2 older messages after clicking More messages
statusReason: expected [ <div …(2)>…(1)</div>, …(9) ] to have a length of 12 but got 10

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
