[Killed] ObjectLiteral
main/components/Commons/ManageCowsModal.jsx:96:16
       </Modal.Body>
       <Modal.Footer
         data-testid={"buy-sell-cow-modal-footer"}
-        style={{ borderTop: "0px" }}
+        style={{}}
       >
         <Button
killedBy: ManageCowsModal Check styling of modal components
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- border-top: 0px;

[Killed] ArithmeticOperator
main/components/Commons/ManageCowsModal.jsx:110:12
           variant="primary"
           onClick={handleSubmit}
         >
-          {message[0].toUpperCase() + message.slice(1)}
+          {message[0].toUpperCase() - message.slice(1)}
         </Button>
       </Modal.Footer>
killedBy: ManageCowsModal modal has correct buy capitalization
statusReason: Unable to find an element with the text: Buy. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 2048px;"
>
