[Killed] BlockStatement
main/components/Courses/CourseTable.jsx:15:34
 export default function CourseTable({ courses, currentUser }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/course/edit/${cell.row.original.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: CourseTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ '/course/edit/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/Courses/CourseTable.jsx:52:43
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(ButtonColumn("Edit", "primary", editCallback, "CourseTable"));
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "CourseTable"),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
   return <OurTable data={courses} columns={columns} testid={"CourseTable"} />;
killedBy: CourseTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="CourseTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] StringLiteral
main/components/Courses/CourseTable.jsx:53:64
   ];
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(ButtonColumn("Edit", "primary", editCallback, "CourseTable"));
+    columns.push(ButtonColumn("Edit", "primary", editCallback, ""));
     columns.push(
       ButtonColumn("Delete", "danger", deleteCallback, "CourseTable"),
killedBy: CourseTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="CourseTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] StringLiteral
main/components/Courses/CourseTable.jsx:55:30
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(ButtonColumn("Edit", "primary", editCallback, "CourseTable"));
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "CourseTable"),
+      ButtonColumn("Delete", "", deleteCallback, "CourseTable"),
     );
   }
killedBy: CourseTable tests Has the expected column headers, content and buttons for admin user
statusReason: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn

[Killed] StringLiteral
main/components/Courses/CourseTable.jsx:59:61
     );
   }
 
-  return <OurTable data={courses} columns={columns} testid={"CourseTable"} />;
+  return <OurTable data={courses} columns={columns} testid={""} />;
 }
 
killedBy: CourseTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="CourseTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >
