[Killed] ArrowFunction
src/main/components/OurTable.jsx:45:29
     <div {...getTableProps()}>
       <Table style={tableStyle} {...getTableProps()} striped bordered hover>
         <thead>
-          {headerGroups.map((headerGroup) => (
-            <tr {...headerGroup.getHeaderGroupProps()} key={headerGroup.id}>
-              {headerGroup.headers.map((column) => (
-                <th
-                  {...column.getHeaderProps(column.getSortByToggleProps())}
-                  key={column.id}
-                  data-testid={`${testid}-header-${column.id}`}
-                >
-                  {column.render("Header")}
-                  <span
-                    data-testid={`${testid}-header-${column.id}-sort-carets`}
-                  >
-                    {column.isSorted
-                      ? column.isSortedDesc
-                        ? " 🔽"
-                        : " 🔼"
-                      : ""}
-                  </span>
-                </th>
-              ))}
-            </tr>
-          ))}
+          {headerGroups.map(() => undefined)}
         </thead>
         <tbody {...getTableBodyProps()}>
killedBy: PagedProfitsTable tests renders correct content
statusReason: Unable to find an element with the text: Profit. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <p>
      Page: 
      1

[Killed] ArrowFunction
src/main/components/OurTable.jsx:47:40
         <thead>
           {headerGroups.map((headerGroup) => (
             <tr {...headerGroup.getHeaderGroupProps()} key={headerGroup.id}>
-              {headerGroup.headers.map((column) => (
-                <th
-                  {...column.getHeaderProps(column.getSortByToggleProps())}
-                  key={column.id}
-                  data-testid={`${testid}-header-${column.id}`}
-                >
-                  {column.render("Header")}
-                  <span
-                    data-testid={`${testid}-header-${column.id}-sort-carets`}
-                  >
-                    {column.isSorted
-                      ? column.isSortedDesc
-                        ? " 🔽"
-                        : " 🔼"
-                      : ""}
-                  </span>
-                </th>
-              ))}
+              {headerGroup.headers.map(() => undefined)}
             </tr>
           ))}
killedBy: PagedJobsTable tests renders correct content
statusReason: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <p>
      Page: 
      1

[Killed] BlockStatement
src/main/components/OurTable.jsx:71:27
         <tbody {...getTableBodyProps()}>
           {rows
             .slice(pageIndex * pageSize, (pageIndex + 1) * pageSize)
-            .map((row) => {
-              prepareRow(row);
-              return (
-                <tr {...row.getRowProps()} key={row.id}>
-                  {row.cells.map((cell, _index) => {
-                    return (
-                      <td
-                        {...cell.getCellProps()}
-                        key={cell.column.id}
-                        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}`}
-                      >
-                        {cell.render("Cell")}
-                      </td>
-                    );
-                  })}
-                </tr>
-              );
-            })}
+            .map((row) => {})}
         </tbody>
       </Table>
killedBy: OurTable tests button appears in the table and triggers callback on click
statusReason: Unable to find an element by: [data-testid="testId-cell-row-0-col-Click-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] BlockStatement
src/main/components/OurTable.jsx:75:52
               prepareRow(row);
               return (
                 <tr {...row.getRowProps()} key={row.id}>
-                  {row.cells.map((cell, _index) => {
-                    return (
-                      <td
-                        {...cell.getCellProps()}
-                        key={cell.column.id}
-                        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}`}
-                      >
-                        {cell.render("Cell")}
-                      </td>
-                    );
-                  })}
+                  {row.cells.map((cell, _index) => {})}
                 </tr>
               );
killedBy: OurTable tests button appears in the table and triggers callback on click
statusReason: Unable to find an element by: [data-testid="testId-cell-row-0-col-Click-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >
