[Killed] BlockStatement
src/main/pages/AdminDeveloperPage.jsx:6:34
 import { Inspector } from "react-inspector";
 import { useSystemInfo } from "main/utils/systemInfo";
 
-const AdminDeveloperPage = () => {
-  const { data: systemInfo } = useSystemInfo();
-  return (
-    <BasicLayout>
-      <h2>Github Branch Information</h2>
-      <p>The following SystemInfo is displayed in a JSON file.</p>
-      <Inspector data={systemInfo} />
-    </BasicLayout>
-  );
-};
+const AdminDeveloperPage = () => {};
 
 export default AdminDeveloperPage;
killedBy: AdminDeveloperPage tests renders without crashing
statusReason: Unable to find an element with the text: Github Branch Information. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
