[Killed] StringLiteral
src/main/pages/PlayPage.jsx:146:13
 
   const chatButtonStyle = {
     width: "60px",
-    height: "60px",
+    height: "",
     borderRadius: "25%",
     backgroundColor: "lightblue",
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

  background-color: lightblue;
  border-radius: 25%;
  bottom: 30px;

[Killed] StringLiteral
src/main/pages/PlayPage.jsx:167:15
 
   const chatContainerStyle = {
     width: "550px",
-    position: "fixed",
+    position: "",
     bottom: "100px",
     right: "20px",
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

  bottom: 100px;
- position: fixed;
  right: 20px;

[Killed] LogicalOperator
src/main/pages/PlayPage.jsx:189:12
         <Container>
           {!commonsPlus && <h1>This commons does not exist!</h1>}
           {notallowed && <h1>You have yet to join this commons!</h1>}
-          {allowed && !!currentUser && (
-            <CommonsPlay currentUser={currentUser} />
-          )}
+          {allowed && !!currentUser || <CommonsPlay currentUser={currentUser} />}
 
           {!!commonsPlus && (
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Unable to find an element by: [data-testid="CommonsPlay"]

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] LogicalOperator
src/main/pages/PlayPage.jsx:224:9
           )}
         </Container>
       </BasicLayout>
-      {(hasRole(currentUser, "ROLE_ADMIN") ||
-        (!!commonsPlus && commonsPlus.commons.showChat)) && (
+      {(hasRole(currentUser, "ROLE_ADMIN") && !!commonsPlus && commonsPlus.commons.showChat) && (
         <div style={chatContainerStyle} data-testid="playpage-chat-div">
           {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
killedBy: PlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Unable to find an element by: [data-testid="playpage-chat-toggle"]

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] LogicalOperator
src/main/pages/PlayPage.jsx:225:10
         </Container>
       </BasicLayout>
       {(hasRole(currentUser, "ROLE_ADMIN") ||
-        (!!commonsPlus && commonsPlus.commons.showChat)) && (
+        (!!commonsPlus || commonsPlus.commons.showChat)) && (
         <div style={chatContainerStyle} data-testid="playpage-chat-div">
           {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
killedBy: PlayPage tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'commons')

[Killed] ArrowFunction
src/main/pages/PlayPage.jsx:247:18
       )}
       <Button
         style={selectCommonPageButtonStyle}
-        onClick={() => navigate("/home")}
+        onClick={() => undefined}
         data-testid="playpage-home-button"
       >
killedBy: PlayPage tests click home button
statusReason: expected "spy" to be called with arguments: [ '/home' ]

Number of calls: 0
